app/controllers/products_controller.rb

  def index_defer
    @pagy, @products = pagy(Product.datatable_filter(params['search']['value'], datatable_searchable_columns).includes(:purchase_products, :sale_products, :category)
                                                                                                             .where(active: true).where(account_id: current_tenant),
                            page: (params[:start].to_i / params[:length].to_i + 1),
                            items: params[:length].to_i)
    @products = @products.datatable_order(params['order']['0']['column'].to_i,
                                          params['order']['0']['dir'])
    options = {}
    options[:meta] = {
      draw: params['draw'].to_i,
      recordsTotal: Product.datatable_filter(params['search']['value'], datatable_searchable_columns).where(active: true).count,
      recordsFiltered: Product.datatable_filter(params['search']['value'], datatable_searchable_columns).where(active: true).count
---
SELECT "products".* FROM "products" WHERE "products"."account_id" = $1 AND "products"."active" = $2 AND "products"."account_id" = $3 ORDER BY custom_id desc LIMIT $4 OFFSET $5  [["account_id", 1], ["active", true], ["account_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."account_id" = $1 AND "products"."active" = $2 AND "products"."account_id" = $3  [["account_id", 1], ["active", true], ["account_id", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."account_id" = $1 AND "products"."active" = $2  [["account_id", 1], ["active", true]]