app/models/user.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "accounts" SET "company_name" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["company_name", "Tetas"], ["updated_at", "2021-05-23 06:56:19.904585"], ["id", 1]]
---
  def assign_account
    ac = Account.find_by(user_id: id)
    ac.update(company_name: company_name)